[
    {
        "poster": "https://m.media-amazon.com/images/M/MV5BMTYwMzMzMDI0NF5BMl5BanBnXkFtZTgwNDQ3NjI3NjE@._V1_SY1000_SX677_AL_.jpg",
        "title": "Beasts of No Nation",
        "plot": "A drama based on the experiences of Agu, a child soldier fighting in the civil war of an unnamed African country.",
        "year": 2015,
        "cast": [
            "Idris Elba",
            "Ama K. Abebrese",
            "Abraham Attah",
            "Richard Pepple"
        ],
        "directors": [
            "Cary Fukunaga"
        ],
        "rated": "Unrated",
        "comments": [],
        "__v": 0,
        "rating": 4
    },
    {
        "poster": "https://m.media-amazon.com/images/M/MV5BNjQzMzYwMzU4OV5BMl5BanBnXkFtZTgwMDg2OTYxOTE@._V1_SY1000_SX677_AL_.jpg",
        "title": "Sam",
        "plot": "An alpha New York City male is magically transformed into a beautiful girl, falls in love, and learns what it means to be a woman.",
        "year": 2015,
        "cast": [
            "Natalie Knepp",
            "Sean Kleier",
            "Morgan Fairchild",
            "Stacy Keach"
        ],
        "directors": [
            "Nicholas Brooks"
        ],
        "rated": "Unrated",
        "comments": [],
        "__v": 0,
        "rating": 4.5
    },
    {
        "poster": "https://m.media-amazon.com/images/M/MV5BMTU2Nzc5ODIxMF5BMl5BanBnXkFtZTgwMTE5MzI3NzE@._V1_SY1000_SX677_AL_.jpg",
        "title": "Eisenstein in Guanajuato",
        "plot": "The venerated filmmaker Eisenstein is comparable in talent, insight and wisdom, with the likes of Shakespeare or Beethoven; there are few - if any - directors who can be elevated to such heights. On the back of his revolutionary film Battleship Potemkin, he was celebrated around the world, and invited to the US. Ultimately rejected by Hollywood and maliciously maligned by conservative Americans, Eisenstein traveled to Mexico in 1931 to consider a film privately funded by American pro-Communist sympathizers, headed by the American writer Upton Sinclair. Eisenstein's sensual Mexican experience appears to have been pivotal in his life and film career - a significant hinge between the early successes of Strike, Battleship Potemkin, and October, which made him a world-renowned figure, and his hesitant later career with Alexander Nevsky, Ivan the Terrible and The Boyar's Plot.",
        "year": 2015,
        "cast": [
            "Elmer Bèck",
            "Luis Alberti",
            "Maya Zapata",
            "Lisa Owen"
        ],
        "directors": [
            "Peter Greenaway"
        ],
        "rated": "UNRATED",
        "comments": [],
        "__v": 0,
        "rating": 1
    },
    {
        "poster": "https://m.media-amazon.com/images/M/MV5BMTUwMTUwODUzNV5BMl5BanBnXkFtZTgwMDIxMDE5NTE@._V1_SY1000_SX677_AL_.jpg",
        "title": "Z for Zachariah",
        "plot": "In the wake of a disaster that wipes out most of civilization, two men and a young woman find themselves in an emotionally charged love triangle as the last known survivors.",
        "year": 2015,
        "cast": [
            "Margot Robbie",
            "Chris Pine",
            "Chiwetel Ejiofor"
        ],
        "directors": [
            "Craig Zobel"
        ],
        "rated": "PG-13",
        "comments": [],
        "__v": 0,
        "rating": 7
    },
    {
        "poster": "https://m.media-amazon.com/images/M/MV5BMTc3OTg3MDUwN15BMl5BanBnXkFtZTgwMTAwMTkxNDE@._V1_SY1000_SX677_AL_.jpg",
        "title": "The DUFF",
        "plot": "Bianca is a content high school senior whose world is shattered when she learns the student body knows her as 'The DUFF' (Designated Ugly Fat Friend) to her prettier, more popular friends. Now, despite the words of caution from her favorite teacher, she puts aside the potential distraction of her crush, Toby, and enlists Wesley, a slick but charming jock, to help reinvent herself. To save her senior year from turning into a total disaster, Bianca must find the confidence to overthrow the school's ruthless label maker Madison and remind everyone that no matter what people look or act like, we are all someone's DUFF.",
        "year": 2015,
        "cast": [
            "Mae Whitman",
            "Robbie Amell",
            "Bella Thorne",
            "Bianca A. Santos"
        ],
        "directors": [
            "Ari Sandel"
        ],
        "rated": "PG-13",
        "comments": [],
        "__v": 0
    },
    {
        "poster": "https://upload.wikimedia.org/wikipedia/en/thumb/a/ab/QOTD_poster.jpg/220px-QOTD_poster.jpg",
        "title": "Queen of the Desert",
        "plot": "A chronicle of Gertrude Bell's life, a traveler, writer, archaeologist, explorer, cartographer, and political attachè for the British Empire at the dawn of the twentieth century.",
        "year": 2015,
        "cast": [
            "James Franco",
            "Nicole Kidman",
            "Robert Pattinson",
            "Damian Lewis"
        ],
        "directors": [
            "Werner Herzog"
        ],
        "rated": "Unrated",
        "comments": [],
        "__v": 0
    },
    {
        "poster": "https://m.media-amazon.com/images/M/MV5BMTUxNzc0OTIxMV5BMl5BanBnXkFtZTgwNDI3NzU2NDE@._V1_SY1000_SX677_AL_.jpg",
        "title": "Ex Machina",
        "plot": "Caleb, a 26 year old coder at the world's largest internet company, wins a competition to spend a week at a private mountain retreat belonging to Nathan, the reclusive CEO of the company. But when Caleb arrives at the remote location he finds that he will have to participate in a strange and fascinating experiment in which he must interact with the world's first true artificial intelligence, housed in the body of a beautiful robot girl.",
        "year": 2015,
        "cast": [
            "Domhnall Gleeson",
            "Corey Johnson",
            "Oscar Isaac",
            "Alicia Vikander"
        ],
        "directors": [
            "Alex Garland"
        ],
        "rated": "R",
        "comments": [],
        "__v": 4,
        "rating": 6.8
    },
    {
        "poster": "https://m.media-amazon.com/images/M/MV5BNzQ3OTY4NjAtNzM5OS00N2ZhLWJlOWUtYzYwZjNmOWRiMzcyXkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_SY1000_SX677_AL_.jpg",
        "title": "Jurassic World",
        "plot": "22 years after the original Jurassic Park failed, the new park (also known as Jurassic World) is open for business. After years of studying genetics the scientists on the park genetically engineer a new breed of dinosaur. When everything goes horribly wrong, will our heroes make it off the island?",
        "year": 2015,
        "cast": [
            "Chris Pratt",
            "Bryce Dallas Howard",
            "Irrfan Khan",
            "Vincent D'Onofrio"
        ],
        "directors": [
            "Colin Trevorrow"
        ],
        "rated": "PG-13",
        "comments": [],
        "__v": 6,
        "rating": 6
    },
    {
        "poster": "https://m.media-amazon.com/images/M/MV5BN2EwM2I5OWMtMGQyMi00Zjg1LWJkNTctZTdjYTA4OGUwZjMyXkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_SY1000_SX677_AL_.jpg",
        "title": "Mad Max: Fury Road",
        "plot": "An apocalyptic story set in the furthest reaches of our planet, in a stark desert landscape where humanity is broken, and almost everyone is crazed fighting for the necessities of life. Within this world exist two rebels on the run who just might be able to restore order. There's Max, a man of action and a man of few words, who seeks peace of mind following the loss of his wife and child in the aftermath of the chaos. And Furiosa, a woman of action and a woman who believes her path to survival may be achieved if she can make it across the desert back to her childhood homeland.",
        "year": 2015,
        "cast": [
            "Tom Hardy",
            "Charlize Theron",
            "Nicholas Hoult",
            "Hugh Keays-Byrne"
        ],
        "directors": [
            "George Miller"
        ],
        "rated": "R",
        "comments": [],
        "__v": 7,
        "rating": 7.25
    },
    {
        "poster": "https://m.media-amazon.com/images/M/MV5BMjMxODYyODEzN15BMl5BanBnXkFtZTgwMDk4OTU0MzE@._V1_SY1000_SX677_AL_.jpg",
        "title": "Cinderella",
        "plot": "A girl named Ella (Cinderella) has the purest heart living in a cruel world filled with evil stepsisters and an evil stepmother out to ruin Ella's life. Ella comes one with her pure heart when she meets the prince and dances her way to a better life with glass shoes, and a little help from her fairy godmother, of course.",
        "year": 2015,
        "cast": [
            "Cate Blanchett",
            "Lily James",
            "Richard Madden",
            "Helena Bonham Carter"
        ],
        "directors": [
            "Kenneth Branagh"
        ],
        "rated": "PG",
        "comments": [],
        "__v": 0,
        "rating": 2
    },
    {
        "poster": "https://m.media-amazon.com/images/M/MV5BMjA0NjA4NjE2Nl5BMl5BanBnXkFtZTgwNzIxNTY2NjE@._V1_SY1000_SX677_AL_.jpg",
        "title": "The Danish Girl",
        "plot": "Copenhagen, early 1920s. Danish artist, Gerda Wegener, painted her own husband, Einar Wegener (Eddie Redmayne), as a lady in her painting. When the painting gained popularity, Einar started to change his appearance into a female appearance and named himself Lili Elbe. With his feminism passion and Gerda's support, Einar - or Elbe attempted first-ever male to female sex reassignment surgery, a decision that turned into a massive change for their marriage, that Gerda realized her own husband is no longer a man or the person she married before. A childhood friend of Einar, art-dealer Hans Axgil (Matthias Schoenaerts), shows up and forms a complex love triangle with the couple.",
        "year": 2015,
        "cast": [
            "Alicia Vikander",
            "Eddie Redmayne",
            "Amber Heard",
            "Matthias Schoenaerts"
        ],
        "directors": [
            "Tom Hooper"
        ],
        "rated": "Unrated",
        "comments": [],
        "__v": 0,
        "rating": 4
    },
    {
        "poster": "https://m.media-amazon.com/images/M/MV5BMjI5MzIxOTgyNl5BMl5BanBnXkFtZTgwMDk4MzA2NjE@._V1_SY1000_SX677_AL_.jpg",
        "title": "Tab Hunter Confidential",
        "plot": "In the 1950s, Tab Hunter is number one at the box office and number one on the music charts. He is Hollywood's most sought-after star and America's boy next door. Natalie Wood, Debbie Reynolds and Sophia Loren are just a few of the actresses he is romantically linked to. Nothing, it seems, can damage his skyrocketing career. Nothing, that is, except for the fact that Tab Hunter is secretly gay. Now, Tab Hunter's secret is out. In TAB HUNTER CONFIDENTIAL we will meet, for the first time, the real Tab Hunter as he shares with us the whole story of a happy, healthy survivor of Hollywood's roller coaster.",
        "year": 2015,
        "cast": [
            "Clint Eastwood",
            "Tab Hunter",
            "Paul Newman",
            "Natalie Wood"
        ],
        "directors": [
            "Jeffrey Schwarz"
        ],
        "rated": "Unrated",
        "comments": [],
        "__v": 3,
        "rating": 6.25
    },
    {
        "poster": "https://m.media-amazon.com/images/M/MV5BMTkyNzk0MTU2Ml5BMl5BanBnXkFtZTgwNDExNzMyNTE@._V1_SY1000_SX677_AL_.jpg",
        "title": "Maggie",
        "plot": "After a couple of weeks seeking out his teenage daughter Maggie, Wade finds her in the quarantine wing of a hospital. Maggie has been infected by a lethal outbreak that transforms the victim into a zombie. Wade's friend Dr. Vern Kaplan releases Maggie to spend her last days with Wade and her family. Her stepmother Caroline asks Wade to take their little kids to her sister's house to keep them safe. While Maggie is slowly transformed, Wade stays with her protecting Maggie. But Dr. Vern warns him that the moment that he will have to take an ultimate decision is closer.",
        "year": 2015,
        "cast": [
            "Arnold Schwarzenegger",
            "Abigail Breslin",
            "Joely Richardson",
            "Douglas M. Griffin"
        ],
        "directors": [
            "Henry Hobson"
        ],
        "rated": "PG-13",
        "comments": [],
        "__v": 0
    },
    {
        "poster": "https://m.media-amazon.com/images/M/MV5BMTk0OTMyMDA0OF5BMl5BanBnXkFtZTgwMzY5NTkzNTE@._V1_SY1000_SX677_AL_.jpg",
        "title": "Fantastic Four",
        "plot": "FANTASTIC FOUR, a contemporary re-imagining of Marvel's original and longest-running superhero team, centers on four young outsiders who teleport to an alternate and dangerous universe, which alters their physical form in shocking ways. Their lives irrevocably upended, the team must learn to harness their daunting new abilities and work together to save Earth from a former friend turned enemy.",
        "year": 2015,
        "cast": [
            "Miles Teller",
            "Michael B. Jordan",
            "Kate Mara",
            "Jamie Bell"
        ],
        "directors": [
            "Josh Trank"
        ],
        "rated": "PG-13",
        "comments": [],
        "__v": 0,
        "rating": 5
    },
    {
        "poster": "https://m.media-amazon.com/images/M/MV5BMTU3MzYzNDEzN15BMl5BanBnXkFtZTgwODM5NTY0MTI@._V1_SY1000_SX677_AL_.jpg",
        "title": "13 Minutes",
        "plot": "The breath-taking story of a man who nearly would have changed the world. 1939, when Hitler tricked millions of people at the height of his power, one said a radical No: Georg Elser, disparaged as an assassin, is one of the greatest resistance fighters.",
        "year": 2015,
        "cast": [
            "Christian Friedel",
            "Katharina Schèttler",
            "Burghart Klauèner",
            "Johann von Bèlow"
        ],
        "directors": [
            "Oliver Hirschbiegel"
        ],
        "rated": "R",
        "comments": [],
        "__v": 0
    },
    {
        "poster": "https://m.media-amazon.com/images/M/MV5BMjIyNzk2MTY0Ml5BMl5BanBnXkFtZTgwMzExNTA2OTE@._V1_SY1000_SX677_AL_.jpg",
        "title": "A Tale of Love and Darkness",
        "plot": "A drama based on the memoir of Amos Oz, a writer, journalist, and advocate of a two-state solution to the Israeli-Palestinian conflict.",
        "year": 2015,
        "cast": [
            "Natalie Portman",
            "Makram Khoury",
            "Shira Haas",
            "Gilad Kahana"
        ],
        "directors": [
            "Natalie Portman"
        ],
        "rated": "Unrated",
        "comments": [],
        "__v": 0,
        "rating": 6
    },
    {
        "poster": "https://m.media-amazon.com/images/M/MV5BMjM2NTQ5Mzc2M15BMl5BanBnXkFtZTgwNTcxMDI2NTE@._V1_SY1000_SX677_AL_.jpg",
        "title": "Ant-Man",
        "plot": "Armed with the astonishing ability to shrink in scale but increase in strength, con-man Scott Lang must embrace his inner-hero and help his mentor, Dr. Hank Pym, protect the secret behind his spectacular Ant-Man suit from a new generation of towering threats. Against seemingly insurmountable obstacles, Pym and Lang must plan and pull off a heist that will save the world.",
        "year": 2015,
        "cast": [
            "Paul Rudd",
            "Michael Douglas",
            "Evangeline Lilly",
            "Corey Stoll"
        ],
        "directors": [
            "Peyton Reed"
        ],
        "rated": "PG-13",
        "comments": [],
        "__v": 0,
        "rating": 7
    },
    {
        "poster": "https://m.media-amazon.com/images/M/MV5BMTQyNzk2MjA2NF5BMl5BanBnXkFtZTgwMjEwNzk3MjE@._V1_SY1000_SX677_AL_.jpg",
        "title": "Jupiter Ascending",
        "plot": "Jupiter Jones was born under a night sky, with signs predicting that she was destined for great things. Now grown, Jupiter dreams of the stars but wakes up to the cold reality of a job cleaning other people's houses and an endless run of bad breaks. Only when Caine Wise, a genetically engineered ex-military hunter, arrives on Earth to track her down does Jupiter begin to glimpse the fate that has been waiting for her all along - her genetic signature marks her as next in line for an extraordinary inheritance that could alter the balance of the cosmos.",
        "year": 2015,
        "cast": [
            "Mila Kunis",
            "Channing Tatum",
            "Sean Bean",
            "Eddie Redmayne"
        ],
        "directors": [
            "Andy Wachowski",
            "Lana Wachowski"
        ],
        "rated": "PG-13",
        "comments": [],
        "__v": 0,
        "rating": 4
    },
    {
        "poster": "https://m.media-amazon.com/images/M/MV5BMTQyNTk0ODU5Ml5BMl5BanBnXkFtZTgwMTc2NzA0NDE@._V1_SY1000_SX677_AL_.jpg",
        "title": "Racing Extinction",
        "plot": "Scientists predict we may lose half the species on the planet by the end of the century. They believe we have entered the sixth major extinction event in Earth's history. Number five took out the dinosaurs. This era is called the Anthropocene, or 'Age of Man', because the evidence shows that humanity has sparked this catastrophic loss. We are the only ones who can stop it as well. The Oceanic Preservation Society, the group behind the Academy Awardè winning film THE COVE, is back for \"Racing Extinction\". Along with some new innovators, OPS will bring a voice to the thousands of species on the very edge of life. An unlikely team of activists is out to expose the two worlds endangering species across the globe. The first threat to the wild comes from the international trade of wildlife. Bogus markets are being created at the expense of creatures who have survived on this planet for millions of years. The other threat is all around us, hiding in plain sight. There's a hidden world that the oil and gas companies don't want the rest of us to see. Director Louie Psihoyos has concocted an ambitious mission to call attention to our impact on the planet, while inspiring others to embrace the solutions that will ensure a thriving planet for future generations.",
        "year": 2015,
        "cast": [
            "Elon Musk",
            "Louie Psihoyos",
            "Jane Goodall",
            "Leilani Mènter"
        ],
        "directors": [
            "Louie Psihoyos"
        ],
        "rated": "Unrated",
        "comments": [],
        "__v": 0,
        "rating": 3
    },
    {
        "poster": "https://m.media-amazon.com/images/M/MV5BMTAzMTQzMTA2MjheQTJeQWpwZ15BbWU4MDk2MTg2MzUx._V1_SY1000_SX677_AL_.jpg",
        "title": "The Age of Adaline",
        "plot": "After miraculously remaining 29 years old for almost eight decades, Adaline Bowman has lived a solitary existence, never allowing herself to get close to anyone who might reveal her secret. But a chance encounter with charismatic philanthropist Ellis Jones reignites her passion for life and romance. When a weekend with his parents threatens to uncover the truth, Adaline makes a decision that will change her life forever.",
        "year": 2015,
        "cast": [
            "Blake Lively",
            "Michiel Huisman",
            "Harrison Ford",
            "Ellen Burstyn"
        ],
        "directors": [
            "Lee Toland Krieger"
        ],
        "rated": "PG-13",
        "comments": [],
        "__v": 0,
        "rating": 6
    },
    {
        "poster": "https://m.media-amazon.com/images/M/MV5BMTY4NjczNjE4OV5BMl5BanBnXkFtZTgwODk0MjQ5NjE@._V1_SY1000_SX677_AL_.jpg",
        "title": "Scouts Guide to the Zombie Apocalypse",
        "plot": "Three scouts, on the eve of their last camp-out, discover the true meaning of friendship when they attempt to save their town from a zombie outbreak.",
        "year": 2015,
        "cast": [
            "Halston Sage",
            "Tye Sheridan",
            "Patrick Schwarzenegger",
            "Cloris Leachman"
        ],
        "directors": [
            "Christopher Landon"
        ],
        "rated": "R",
        "comments": [],
        "__v": 0
    },
    {
        "poster": "https://m.media-amazon.com/images/M/MV5BMjM1NTc0NzE4OF5BMl5BanBnXkFtZTgwNDkyNjQ1NTE@._V1_SY1000_SX677_AL_.jpg",
        "title": "Terminator Genisys",
        "plot": "When John Connor (Jason Clarke), leader of the human resistance, sends Sgt. Kyle Reese (Jai Courtney) back to 1984 to protect Sarah Connor (Emilia Clarke) and safeguard the future, an unexpected turn of events creates a fractured timeline. Now, Sgt. Reese finds himself in a new and unfamiliar version of the past, where he is faced with unlikely allies, including the Guardian (Arnold Schwarzenegger), dangerous new enemies, and an unexpected new mission: To reset the future...",
        "year": 2015,
        "cast": [
            "Arnold Schwarzenegger",
            "Jason Clarke",
            "Emilia Clarke",
            "Jai Courtney"
        ],
        "directors": [
            "Alan Taylor"
        ],
        "rated": "PG-13",
        "comments": [],
        "__v": 0,
        "rating": 6.5
    },
    {
        "poster": "https://m.media-amazon.com/images/M/MV5BMTUyNDIyMTA4NV5BMl5BanBnXkFtZTgwODM2MDMxNjE@._V1_SY1000_SX677_AL_.jpg",
        "title": "The Stanford Prison Experiment",
        "plot": "Twenty-four male students out of seventy-five were selected to take on randomly assigned roles of prisoners and guards in a mock prison situated in the basement of the Stanford psychology building.",
        "year": 2015,
        "cast": [
            "Billy Crudup",
            "Michael Angarano",
            "Moises Arias",
            "Nicholas Braun"
        ],
        "directors": [
            "Kyle Patrick Alvarez"
        ],
        "rated": "R",
        "comments": [],
        "__v": 21,
        "rating": 7.666666666666667
    },
    {
        "poster": "https://m.media-amazon.com/images/M/MV5BMTg4Mjc0NTE1NV5BMl5BanBnXkFtZTgwNzcwNTQ3NTE@._V1_SY1000_SX677_AL_.jpg",
        "title": "Aloha",
        "plot": "A celebrated military contractor returns to the site of his greatest career triumphs - the US Space program in Honolulu, Hawaii - and reconnects with a long-ago love while unexpectedly falling for the hard-charging Air Force watchdog assigned to him.",
        "year": 2015,
        "cast": [
            "Bradley Cooper",
            "Emma Stone",
            "Rachel McAdams",
            "Bill Murray"
        ],
        "directors": [
            "Cameron Crowe"
        ],
        "rated": "PG-13",
        "comments": [],
        "__v": 0,
        "rating": 7
    },
    {
        "poster": "https://m.media-amazon.com/images/M/MV5BMTQ5MjI1OTA2NV5BMl5BanBnXkFtZTgwNjMxMjE3NjE@._V1_SY1000_SX677_AL_.jpg",
        "title": "Drunk Stoned Brilliant Dead: The Story of the National Lampoon",
        "plot": "Featuring rare and never before seen footage, this is the mind boggling story of The National Lampoon from its subversive and electrifying beginnings, to rebirth as an unlikely Hollywood heavyweight, and beyond. A humour empire like no other, the impact of the magazines irreverent, often shocking, sensibility was nothing short of seismic: this is an institution whose (drunk stoned brilliant) alumni left their fingerprints all over popular culture. Both insanely great and breathtakingly innovative, The National Lampoon created the foundation of modern comic sensibility by setting the bar in comedy impossibly high.",
        "year": 2015,
        "cast": [
            "Judd Apatow",
            "Kevin Bacon",
            "John Belushi",
            "Richard Belzer"
        ],
        "directors": [
            "Douglas Tirola"
        ],
        "rated": "Unrated",
        "comments": [],
        "__v": 0,
        "rating": 4
    }
]
